nxp-mcuxpresso/mcux-sdk/boards/isi_qmc_dgc/project_template/cm4/pin_mux.c
/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitDebugUartsPins(); // TODO: remove after debug
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
	  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

	  IOMUXC_SetPinMux(
		  IOMUXC_GPIO_AD_24_LPUART1_TXD,          /* GPIO_AD_24 is configured as LPUART1_TXD */
		  0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	  IOMUXC_SetPinMux(
		  IOMUXC_GPIO_AD_25_LPUART1_RXD,          /* GPIO_AD_25 is configured as LPUART1_RXD */
		  0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitAdcPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: N13, peripheral: LPADC1, signal: 'A, 1_0', pin_signal: GPIO_AD_06}
  - {pin_num: R15, peripheral: LPADC1, signal: 'A, 1_1', pin_signal: GPIO_AD_08}
  - {pin_num: R17, peripheral: LPADC1, signal: 'A, 1_2', pin_signal: GPIO_AD_10}
  - {pin_num: P17, peripheral: LPADC1, signal: 'A, 1_3', pin_signal: GPIO_AD_12}
  - {pin_num: N14, peripheral: LPADC1, signal: 'A, 1_4', pin_signal: GPIO_AD_14}
  - {pin_num: N17, peripheral: LPADC1, signal: 'A, 1_5', pin_signal: GPIO_AD_16}
  - {pin_num: T17, peripheral: LPADC1, signal: 'B, 1_0', pin_signal: GPIO_AD_07}
  - {pin_num: R16, peripheral: LPADC1, signal: 'B, 1_1', pin_signal: GPIO_AD_09}
  - {pin_num: P16, peripheral: LPADC1, signal: 'B, 1_2', pin_signal: GPIO_AD_11}
  - {pin_num: L12, peripheral: LPADC1, signal: 'B, 1_3', pin_signal: GPIO_AD_13}
  - {pin_num: M14, peripheral: LPADC1, signal: 'B, 1_4', pin_signal: GPIO_AD_15}
  - {pin_num: N15, peripheral: LPADC1, signal: 'B, 1_5', pin_signal: GPIO_AD_17}
  - {pin_num: M16, peripheral: LPADC2, signal: 'A, 2_0', pin_signal: GPIO_AD_18, pull_up_down_config: Pull_Down}
  - {pin_num: K13, peripheral: LPADC2, signal: 'A, 2_1', pin_signal: GPIO_AD_20}
  - {pin_num: K12, peripheral: LPADC2, signal: 'A, 2_2', pin_signal: GPIO_AD_22}
  - {pin_num: P17, peripheral: LPADC2, signal: 'A, 2_3', pin_signal: GPIO_AD_12, identifier: ''}
  - {pin_num: N14, peripheral: LPADC2, signal: 'A, 2_4', pin_signal: GPIO_AD_14, identifier: ''}
  - {pin_num: N17, peripheral: LPADC2, signal: 'A, 2_5', pin_signal: GPIO_AD_16, identifier: ''}
  - {pin_num: L13, peripheral: LPADC2, signal: 'A, 2_6', pin_signal: GPIO_AD_24}
  - {pin_num: L16, peripheral: LPADC2, signal: 'B, 2_0', pin_signal: GPIO_AD_19}
  - {pin_num: K14, peripheral: LPADC2, signal: 'B, 2_1', pin_signal: GPIO_AD_21}
  - {pin_num: J12, peripheral: LPADC2, signal: 'B, 2_2', pin_signal: GPIO_AD_23}
  - {pin_num: L12, peripheral: LPADC2, signal: 'B, 2_3', pin_signal: GPIO_AD_13, identifier: ''}
  - {pin_num: M14, peripheral: LPADC2, signal: 'B, 2_4', pin_signal: GPIO_AD_15, identifier: ''}
  - {pin_num: N15, peripheral: LPADC2, signal: 'B, 2_5', pin_signal: GPIO_AD_17, identifier: ''}
  - {pin_num: M15, peripheral: LPADC2, signal: 'B, 2_6', pin_signal: GPIO_AD_25}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitAdcPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitAdcPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_06_GPIO_MUX3_IO05,       /* GPIO_AD_06 is configured as GPIO_MUX3_IO05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_07_GPIO_MUX3_IO06,       /* GPIO_AD_07 is configured as GPIO_MUX3_IO06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_08_GPIO_MUX3_IO07,       /* GPIO_AD_08 is configured as GPIO_MUX3_IO07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_09_GPIO_MUX3_IO08,       /* GPIO_AD_09 is configured as GPIO_MUX3_IO08 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_10_GPIO_MUX3_IO09,       /* GPIO_AD_10 is configured as GPIO_MUX3_IO09 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_11_GPIO_MUX3_IO10,       /* GPIO_AD_11 is configured as GPIO_MUX3_IO10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_12_GPIO_MUX3_IO11,       /* GPIO_AD_12 is configured as GPIO_MUX3_IO11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_13_GPIO_MUX3_IO12,       /* GPIO_AD_13 is configured as GPIO_MUX3_IO12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_14_GPIO_MUX3_IO13,       /* GPIO_AD_14 is configured as GPIO_MUX3_IO13 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_15_GPIO_MUX3_IO14,       /* GPIO_AD_15 is configured as GPIO_MUX3_IO14 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_16_GPIO_MUX3_IO15,       /* GPIO_AD_16 is configured as GPIO_MUX3_IO15 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_17_GPIO_MUX3_IO16,       /* GPIO_AD_17 is configured as GPIO_MUX3_IO16 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_18_GPIO_MUX3_IO17,       /* GPIO_AD_18 is configured as GPIO_MUX3_IO17 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_19_GPIO_MUX3_IO18,       /* GPIO_AD_19 is configured as GPIO_MUX3_IO18 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_20_GPIO_MUX3_IO19,       /* GPIO_AD_20 is configured as GPIO_MUX3_IO19 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_21_GPIO_MUX3_IO20,       /* GPIO_AD_21 is configured as GPIO_MUX3_IO20 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_22_GPIO_MUX3_IO21,       /* GPIO_AD_22 is configured as GPIO_MUX3_IO21 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_23_GPIO_MUX3_IO22,       /* GPIO_AD_23 is configured as GPIO_MUX3_IO22 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_24_GPIO_MUX3_IO23,       /* GPIO_AD_24 is configured as GPIO_MUX3_IO23 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_25_GPIO_MUX3_IO24,       /* GPIO_AD_25 is configured as GPIO_MUX3_IO24 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_18_GPIO_MUX3_IO17,       /* GPIO_AD_18 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}


