nxp-mcuxpresso/mcux-sdk/boards/isi_qmc_dgc/project_template/cm4/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPwmFaultPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: T1, peripheral: PWM1, signal: 'FAULT, 0', pin_signal: GPIO_EMC_B2_06}
  - {pin_num: M3, peripheral: PWM2, signal: 'FAULT, 0', pin_signal: GPIO_EMC_B2_07}
  - {pin_num: P1, peripheral: PWM3, signal: 'FAULT, 0', pin_signal: GPIO_EMC_B2_08}
  - {pin_num: N2, peripheral: PWM4, signal: 'FAULT, 0', pin_signal: GPIO_EMC_B2_09}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPwmFaultPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPwmFaultPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_06_XBAR1_INOUT26,    /* GPIO_EMC_B2_06 is configured as XBAR1_INOUT26 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_07_XBAR1_INOUT27,    /* GPIO_EMC_B2_07 is configured as XBAR1_INOUT27 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_08_XBAR1_INOUT28,    /* GPIO_EMC_B2_08 is configured as XBAR1_INOUT28 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_09_XBAR1_INOUT29,    /* GPIO_EMC_B2_09 is configured as XBAR1_INOUT29 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_GPR->GPR20 = ((IOMUXC_GPR->GPR20 &
    (~(IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_26_MASK | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_27_MASK | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_28_MASK | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_29_MASK))) /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_26(0x00U) /* IOMUXC XBAR_INOUT26 function direction select: 0x00U */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_27(0x00U) /* IOMUXC XBAR_INOUT27 function direction select: 0x00U */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_28(0x00U) /* IOMUXC XBAR_INOUT28 function direction select: 0x00U */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_29(0x00U) /* IOMUXC XBAR_INOUT29 function direction select: 0x00U */
    );
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout26, kXBARA1_OutputFlexpwm1Fault0); /* IOMUX_XBAR_INOUT26 output assigned to XBARA1_IN26 input is connected to XBARA1_OUT58 output assigned to FLEXPWM1_FAULT0 */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout27, kXBARA1_OutputFlexpwm2Fault0); /* IOMUX_XBAR_INOUT27 output assigned to XBARA1_IN27 input is connected to XBARA1_OUT72 output assigned to FLEXPWM2_FAULT0 */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout28, kXBARA1_OutputFlexpwm3Fault0); /* IOMUX_XBAR_INOUT28 output assigned to XBARA1_IN28 input is connected to XBARA1_OUT84 output assigned to FLEXPWM3_FAULT0 */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout29, kXBARA1_OutputFlexpwm4Fault0); /* IOMUX_XBAR_INOUT29 output assigned to XBARA1_IN29 input is connected to XBARA1_OUT91 output assigned to FLEXPWM4_FAULT0 */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitEncPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: K2, peripheral: ENC1, signal: INDEX, pin_signal: GPIO_EMC_B2_00}
  - {pin_num: K4, peripheral: ENC1, signal: 'PHASE, A', pin_signal: GPIO_EMC_B2_01}
  - {pin_num: K3, peripheral: ENC1, signal: 'PHASE, B', pin_signal: GPIO_EMC_B2_02}
  - {pin_num: R1, peripheral: ENC2, signal: INDEX, pin_signal: GPIO_EMC_B2_03}
  - {pin_num: M1, peripheral: ENC2, signal: 'PHASE, A', pin_signal: GPIO_EMC_B2_04}
  - {pin_num: N1, peripheral: ENC2, signal: 'PHASE, B', pin_signal: GPIO_EMC_B2_05}
  - {pin_num: C5, peripheral: ENC3, signal: INDEX, pin_signal: GPIO_EMC_B1_12}
  - {pin_num: D5, peripheral: ENC3, signal: 'PHASE, A', pin_signal: GPIO_EMC_B1_13}
  - {pin_num: B1, peripheral: ENC3, signal: 'PHASE, B', pin_signal: GPIO_EMC_B1_14}
  - {pin_num: F1, peripheral: ENC4, signal: INDEX, pin_signal: GPIO_EMC_B1_35}
  - {pin_num: G1, peripheral: ENC4, signal: 'PHASE, A', pin_signal: GPIO_EMC_B1_36}
  - {pin_num: H1, peripheral: ENC4, signal: 'PHASE, B', pin_signal: GPIO_EMC_B1_37}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitEncPins, assigned for the Cortex-M7F core.
 * Description   : Configures ENC pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitEncPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_12_XBAR1_INOUT04,    /* GPIO_EMC_B1_12 is configured as XBAR1_INOUT04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_13_XBAR1_INOUT05,    /* GPIO_EMC_B1_13 is configured as XBAR1_INOUT05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_14_XBAR1_INOUT06,    /* GPIO_EMC_B1_14 is configured as XBAR1_INOUT06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_35_XBAR1_INOUT09,    /* GPIO_EMC_B1_35 is configured as XBAR1_INOUT09 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_36_XBAR1_INOUT10,    /* GPIO_EMC_B1_36 is configured as XBAR1_INOUT10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_37_XBAR1_INOUT11,    /* GPIO_EMC_B1_37 is configured as XBAR1_INOUT11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_00_XBAR1_INOUT20,    /* GPIO_EMC_B2_00 is configured as XBAR1_INOUT20 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_01_XBAR1_INOUT21,    /* GPIO_EMC_B2_01 is configured as XBAR1_INOUT21 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_02_XBAR1_INOUT22,    /* GPIO_EMC_B2_02 is configured as XBAR1_INOUT22 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_03_XBAR1_INOUT23,    /* GPIO_EMC_B2_03 is configured as XBAR1_INOUT23 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_04_XBAR1_INOUT24,    /* GPIO_EMC_B2_04 is configured as XBAR1_INOUT24 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_05_XBAR1_INOUT25,    /* GPIO_EMC_B2_05 is configured as XBAR1_INOUT25 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_GPR->GPR20 = ((IOMUXC_GPR->GPR20 &
    (~(IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_4_MASK | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_5_MASK | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_6_MASK | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_9_MASK | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_10_MASK | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_11_MASK | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_20_MASK | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_21_MASK | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_22_MASK | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_23_MASK | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_24_MASK | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_25_MASK))) /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_4(0x00U) /* IOMUXC XBAR_INOUT4 function direction select: 0x00U */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_5(0x00U) /* IOMUXC XBAR_INOUT5 function direction select: 0x00U */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_6(0x00U) /* IOMUXC XBAR_INOUT6 function direction select: 0x00U */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_9(0x00U) /* IOMUXC XBAR_INOUT9 function direction select: 0x00U */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_10(0x00U) /* IOMUXC XBAR_INOUT10 function direction select: 0x00U */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_11(0x00U) /* IOMUXC XBAR_INOUT11 function direction select: 0x00U */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_20(0x00U) /* IOMUXC XBAR_INOUT20 function direction select: 0x00U */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_21(0x00U) /* IOMUXC XBAR_INOUT21 function direction select: 0x00U */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_22(0x00U) /* IOMUXC XBAR_INOUT22 function direction select: 0x00U */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_23(0x00U) /* IOMUXC XBAR_INOUT23 function direction select: 0x00U */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_24(0x00U) /* IOMUXC XBAR_INOUT24 function direction select: 0x00U */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_25(0x00U) /* IOMUXC XBAR_INOUT25 function direction select: 0x00U */
    );
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout21, kXBARA1_OutputDec1Phasea); /* IOMUX_XBAR_INOUT21 output assigned to XBARA1_IN21 input is connected to XBARA1_OUT108 output assigned to DEC1_PHASEA */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout22, kXBARA1_OutputDec1Phaseb); /* IOMUX_XBAR_INOUT22 output assigned to XBARA1_IN22 input is connected to XBARA1_OUT109 output assigned to DEC1_PHASEB */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout20, kXBARA1_OutputDec1Index); /* IOMUX_XBAR_INOUT20 output assigned to XBARA1_IN20 input is connected to XBARA1_OUT110 output assigned to DEC1_INDEX */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout24, kXBARA1_OutputDec2Phasea); /* IOMUX_XBAR_INOUT24 output assigned to XBARA1_IN24 input is connected to XBARA1_OUT113 output assigned to DEC2_PHASEA */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout25, kXBARA1_OutputDec2Phaseb); /* IOMUX_XBAR_INOUT25 output assigned to XBARA1_IN25 input is connected to XBARA1_OUT114 output assigned to DEC2_PHASEB */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout23, kXBARA1_OutputDec2Index); /* IOMUX_XBAR_INOUT23 output assigned to XBARA1_IN23 input is connected to XBARA1_OUT115 output assigned to DEC2_INDEX */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout05, kXBARA1_OutputDec3Phasea); /* IOMUX_XBAR_INOUT05 output assigned to XBARA1_IN5 input is connected to XBARA1_OUT118 output assigned to DEC3_PHASEA */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout06, kXBARA1_OutputDec3Phaseb); /* IOMUX_XBAR_INOUT06 output assigned to XBARA1_IN6 input is connected to XBARA1_OUT119 output assigned to DEC3_PHASEB */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout04, kXBARA1_OutputDec3Index); /* IOMUX_XBAR_INOUT04 output assigned to XBARA1_IN4 input is connected to XBARA1_OUT120 output assigned to DEC3_INDEX */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout10, kXBARA1_OutputDec4Phasea); /* IOMUX_XBAR_INOUT10 output assigned to XBARA1_IN10 input is connected to XBARA1_OUT123 output assigned to DEC4_PHASEA */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout11, kXBARA1_OutputDec4Phaseb); /* IOMUX_XBAR_INOUT11 output assigned to XBARA1_IN11 input is connected to XBARA1_OUT124 output assigned to DEC4_PHASEB */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout09, kXBARA1_OutputDec4Index); /* IOMUX_XBAR_INOUT09 output assigned to XBARA1_IN9 input is connected to XBARA1_OUT125 output assigned to DEC4_INDEX */
}


