nxp-mcuxpresso/mcux-sdk/boards/isi_qmc_dgc/project_template/cm4/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPowerStageSPIsPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: C1, peripheral: FLEXIO1, signal: 'IO, 15', pin_signal: GPIO_EMC_B1_15, direction: OUTPUT}
  - {pin_num: D3, peripheral: FLEXIO1, signal: 'IO, 16', pin_signal: GPIO_EMC_B1_16, direction: INPUT}
  - {pin_num: B3, peripheral: FLEXIO1, signal: 'IO, 17', pin_signal: GPIO_EMC_B1_17, direction: OUTPUT}
  - {pin_num: B4, peripheral: FLEXIO1, signal: 'IO, 18', pin_signal: GPIO_EMC_B1_18, direction: OUTPUT}
  - {pin_num: C4, peripheral: FLEXIO1, signal: 'IO, 19', pin_signal: GPIO_EMC_B1_19, direction: OUTPUT}
  - {pin_num: C3, peripheral: FLEXIO1, signal: 'IO, 20', pin_signal: GPIO_EMC_B1_20, direction: INPUT}
  - {pin_num: G2, peripheral: FLEXIO1, signal: 'IO, 21', pin_signal: GPIO_EMC_B1_21, direction: OUTPUT}
  - {pin_num: H2, peripheral: FLEXIO1, signal: 'IO, 22', pin_signal: GPIO_EMC_B1_22, direction: OUTPUT}
  - {pin_num: M13, peripheral: FLEXIO2, signal: 'IO, 04', pin_signal: GPIO_AD_04, direction: OUTPUT}
  - {pin_num: P13, peripheral: FLEXIO2, signal: 'IO, 05', pin_signal: GPIO_AD_05, direction: INPUT}
  - {pin_num: L14, peripheral: FLEXIO2, signal: 'IO, 26', pin_signal: GPIO_AD_26}
  - {pin_num: N16, peripheral: FLEXIO2, signal: 'IO, 27', pin_signal: GPIO_AD_27, direction: OUTPUT}
  - {pin_num: L17, peripheral: FLEXIO2, signal: 'IO, 28', pin_signal: GPIO_AD_28, direction: OUTPUT}
  - {pin_num: M17, peripheral: FLEXIO2, signal: 'IO, 29', pin_signal: GPIO_AD_29, direction: INPUT}
  - {pin_num: K17, peripheral: FLEXIO2, signal: 'IO, 30', pin_signal: GPIO_AD_30, direction: OUTPUT}
  - {pin_num: J17, peripheral: FLEXIO2, signal: 'IO, 31', pin_signal: GPIO_AD_31, direction: OUTPUT}
  - {pin_num: N9, peripheral: GPIO13, signal: 'gpio_io, 11', pin_signal: GPIO_SNVS_08}
  - {pin_num: R11, peripheral: GPIO13, signal: 'gpio_io, 12', pin_signal: GPIO_SNVS_09}
  - {pin_num: R5, peripheral: GPIO12, signal: 'gpio_io, 10', pin_signal: GPIO_LPSR_10}
  - {pin_num: T5, peripheral: GPIO12, signal: 'gpio_io, 11', pin_signal: GPIO_LPSR_11}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPowerStageSPIsPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPowerStageSPIsPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr);      /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_04_FLEXIO2_D04,          /* GPIO_AD_04 is configured as FLEXIO2_D04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_05_FLEXIO2_D05,          /* GPIO_AD_05 is configured as FLEXIO2_D05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_26_FLEXIO2_D26,          /* GPIO_AD_26 is configured as FLEXIO2_D26 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_27_FLEXIO2_D27,          /* GPIO_AD_27 is configured as FLEXIO2_D27 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_28_FLEXIO2_D28,          /* GPIO_AD_28 is configured as FLEXIO2_D28 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_29_FLEXIO2_D29,          /* GPIO_AD_29 is configured as FLEXIO2_D29 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_30_FLEXIO2_D30,          /* GPIO_AD_30 is configured as FLEXIO2_D30 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_31_FLEXIO2_D31,          /* GPIO_AD_31 is configured as FLEXIO2_D31 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_15_FLEXIO1_D15,      /* GPIO_EMC_B1_15 is configured as FLEXIO1_D15 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_16_FLEXIO1_D16,      /* GPIO_EMC_B1_16 is configured as FLEXIO1_D16 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_17_FLEXIO1_D17,      /* GPIO_EMC_B1_17 is configured as FLEXIO1_D17 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_18_FLEXIO1_D18,      /* GPIO_EMC_B1_18 is configured as FLEXIO1_D18 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_19_FLEXIO1_D19,      /* GPIO_EMC_B1_19 is configured as FLEXIO1_D19 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_20_FLEXIO1_D20,      /* GPIO_EMC_B1_20 is configured as FLEXIO1_D20 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_21_FLEXIO1_D21,      /* GPIO_EMC_B1_21 is configured as FLEXIO1_D21 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_22_FLEXIO1_D22,      /* GPIO_EMC_B1_22 is configured as FLEXIO1_D22 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_10_GPIO12_IO10,        /* GPIO_LPSR_10 is configured as GPIO12_IO10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_11_GPIO12_IO11,        /* GPIO_LPSR_11 is configured as GPIO12_IO11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_08_DIG_GPIO13_IO11,    /* GPIO_SNVS_08_DIG is configured as GPIO13_IO11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_09_DIG_GPIO13_IO12,    /* GPIO_SNVS_09_DIG is configured as GPIO13_IO12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


