nxp-mcuxpresso/mcux-sdk/boards/isi_qmc_dgc/project_template/cm4/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitRs485Pins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: N12, peripheral: LPUART7, signal: TXD, pin_signal: GPIO_AD_00}
  - {pin_num: R14, peripheral: LPUART7, signal: RXD, pin_signal: GPIO_AD_01}
  - {pin_num: P15, peripheral: LPUART7, signal: RTS_B, pin_signal: GPIO_AD_03}
  - {pin_num: R13, peripheral: LPUART7, signal: CTS_B, pin_signal: GPIO_AD_02}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitRs485Pins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitRs485Pins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_00_LPUART7_TXD,          /* GPIO_AD_00 is configured as LPUART7_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_01_LPUART7_RXD,          /* GPIO_AD_01 is configured as LPUART7_RXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_02_LPUART7_CTS_B,        /* GPIO_AD_02 is configured as LPUART7_CTS_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_03_LPUART7_RTS_B,        /* GPIO_AD_03 is configured as LPUART7_RTS_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFlexioPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFlexioPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFlexioPins(void) {
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitUserButtonsPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: P8, peripheral: GPIO6, signal: 'gpio_mux_io, 06', pin_signal: GPIO_LPSR_06, direction: INPUT, gpio_interrupt: kGPIO_IntRisingEdge, pull_up_down_config: Pull_Up,
    pull_keeper_select: Pull, drive_strength: Normal}
  - {pin_num: R8, peripheral: GPIO6, signal: 'gpio_mux_io, 07', pin_signal: GPIO_LPSR_07, direction: INPUT, gpio_interrupt: kGPIO_IntRisingEdge, pull_up_down_config: Pull_Up,
    pull_keeper_select: Pull, drive_strength: Normal}
  - {pin_num: U8, peripheral: GPIO6, signal: 'gpio_mux_io, 08', pin_signal: GPIO_LPSR_08, direction: INPUT, gpio_interrupt: kGPIO_IntRisingEdge, pull_up_down_config: Pull_Up,
    pull_keeper_select: Pull, drive_strength: Normal}
  - {pin_num: P5, peripheral: GPIO6, signal: 'gpio_mux_io, 09', pin_signal: GPIO_LPSR_09, direction: INPUT, gpio_interrupt: kGPIO_IntRisingEdge, pull_up_down_config: Pull_Up,
    pull_keeper_select: Pull, drive_strength: Normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUserButtonsPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitUserButtonsPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr);      /* LPCG on: LPCG is ON. */

  /* GPIO configuration of USER_BUTTON1 on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_06 (pin P8) */
  gpio_pin_config_t USER_BUTTON1_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_IntRisingEdge
  };
  /* Initialize GPIO functionality on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_06 (pin P8) */
  GPIO_PinInit(GPIO6, 6U, &USER_BUTTON1_config);
  /* Enable GPIO pin interrupt on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_06 (pin P8) */
  GPIO_PortEnableInterrupts(GPIO6, 1U << 6U);

  /* GPIO configuration of USER_BUTTON2 on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_07 (pin R8) */
  gpio_pin_config_t USER_BUTTON2_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_IntRisingEdge
  };
  /* Initialize GPIO functionality on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_07 (pin R8) */
  GPIO_PinInit(GPIO6, 7U, &USER_BUTTON2_config);
  /* Enable GPIO pin interrupt on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_07 (pin R8) */
  GPIO_PortEnableInterrupts(GPIO6, 1U << 7U);

  /* GPIO configuration of USER_BUTTON3 on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_08 (pin U8) */
  gpio_pin_config_t USER_BUTTON3_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_IntRisingEdge
  };
  /* Initialize GPIO functionality on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_08 (pin U8) */
  GPIO_PinInit(GPIO6, 8U, &USER_BUTTON3_config);
  /* Enable GPIO pin interrupt on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_08 (pin U8) */
  GPIO_PortEnableInterrupts(GPIO6, 1U << 8U);

  /* GPIO configuration of USER_BUTTON4 on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_09 (pin P5) */
  gpio_pin_config_t USER_BUTTON4_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_IntRisingEdge
  };
  /* Initialize GPIO functionality on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_09 (pin P5) */
  GPIO_PinInit(GPIO6, 9U, &USER_BUTTON4_config);
  /* Enable GPIO pin interrupt on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_09 (pin P5) */
  GPIO_PortEnableInterrupts(GPIO6, 1U << 9U);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_06_GPIO_MUX6_IO06,     /* GPIO_LPSR_06 is configured as GPIO_MUX6_IO06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_07_GPIO_MUX6_IO07,     /* GPIO_LPSR_07 is configured as GPIO_MUX6_IO07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_08_GPIO_MUX6_IO08,     /* GPIO_LPSR_08 is configured as GPIO_MUX6_IO08 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_09_GPIO_MUX6_IO09,     /* GPIO_LPSR_09 is configured as GPIO_MUX6_IO09 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_LPSR_06_GPIO_MUX6_IO06,     /* GPIO_LPSR_06 PAD functional properties : */
      0x0CU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain LPSR Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_LPSR_07_GPIO_MUX6_IO07,     /* GPIO_LPSR_07 PAD functional properties : */
      0x0CU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain LPSR Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_LPSR_08_GPIO_MUX6_IO08,     /* GPIO_LPSR_08 PAD functional properties : */
      0x0CU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain LPSR Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_LPSR_09_GPIO_MUX6_IO09,     /* GPIO_LPSR_09 PAD functional properties : */
      0x0CU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain LPSR Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}


