nxp-mcuxpresso/mcux-sdk/boards/isi_qmc_dgc/project_template/cm4/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDigitalInputPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: J1, peripheral: GPIO2, signal: 'gpio_mux_io, 06', pin_signal: GPIO_EMC_B1_38, direction: INPUT}
  - {pin_num: J2, peripheral: GPIO2, signal: 'gpio_mux_io, 07', pin_signal: GPIO_EMC_B1_39, direction: INPUT}
  - {pin_num: T2, peripheral: GPIO2, signal: 'gpio_mux_io, 27', pin_signal: GPIO_EMC_B2_17, direction: INPUT}
  - {pin_num: H17, peripheral: GPIO4, signal: 'gpio_mux_io, 00', pin_signal: GPIO_AD_33, direction: INPUT}
  - {pin_num: N10, peripheral: GPIO13, signal: 'gpio_io, 07', pin_signal: GPIO_SNVS_04, direction: INPUT}
  - {pin_num: P9, peripheral: GPIO13, signal: 'gpio_io, 08', pin_signal: GPIO_SNVS_05, direction: INPUT}
  - {pin_num: M9, peripheral: GPIO13, signal: 'gpio_io, 09', pin_signal: GPIO_SNVS_06, direction: INPUT}
  - {pin_num: R9, peripheral: GPIO13, signal: 'gpio_io, 10', pin_signal: GPIO_SNVS_07, direction: INPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDigitalInputPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDigitalInputPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  /* GPIO configuration of DIG_INPUT_0 on GPIO_EMC_B1_38 (pin J1) */
  gpio_pin_config_t DIG_INPUT_0_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_38 (pin J1) */
  GPIO_PinInit(GPIO2, 6U, &DIG_INPUT_0_config);

  /* GPIO configuration of DIG_INPUT_1 on GPIO_EMC_B1_39 (pin J2) */
  gpio_pin_config_t DIG_INPUT_1_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_39 (pin J2) */
  GPIO_PinInit(GPIO2, 7U, &DIG_INPUT_1_config);

  /* GPIO configuration of DIG_INPUT_2 on GPIO_EMC_B2_17 (pin T2) */
  gpio_pin_config_t DIG_INPUT_2_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_17 (pin T2) */
  GPIO_PinInit(GPIO2, 27U, &DIG_INPUT_2_config);

  /* GPIO configuration of DIG_INPUT_3 on GPIO_AD_33 (pin H17) */
  gpio_pin_config_t DIG_INPUT_3_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_33 (pin H17) */
  GPIO_PinInit(GPIO4, 0U, &DIG_INPUT_3_config);

  /* GPIO configuration of DIG_INPUT_4_SNVS on GPIO_SNVS_04_DIG (pin N10) */
  gpio_pin_config_t DIG_INPUT_4_SNVS_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_04_DIG (pin N10) */
  GPIO_PinInit(GPIO13, 7U, &DIG_INPUT_4_SNVS_config);

  /* GPIO configuration of DIG_INPUT_5_SNVS on GPIO_SNVS_05_DIG (pin P9) */
  gpio_pin_config_t DIG_INPUT_5_SNVS_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_05_DIG (pin P9) */
  GPIO_PinInit(GPIO13, 8U, &DIG_INPUT_5_SNVS_config);

  /* GPIO configuration of DIG_INPUT_6_SNVS on GPIO_SNVS_06_DIG (pin M9) */
  gpio_pin_config_t DIG_INPUT_6_SNVS_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_06_DIG (pin M9) */
  GPIO_PinInit(GPIO13, 9U, &DIG_INPUT_6_SNVS_config);

  /* GPIO configuration of DIG_INPUT_7_SNVS on GPIO_SNVS_07_DIG (pin R9) */
  gpio_pin_config_t DIG_INPUT_7_SNVS_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_07_DIG (pin R9) */
  GPIO_PinInit(GPIO13, 10U, &DIG_INPUT_7_SNVS_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_33_GPIO_MUX4_IO00,       /* GPIO_AD_33 is configured as GPIO_MUX4_IO00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_38_GPIO_MUX2_IO06,   /* GPIO_EMC_B1_38 is configured as GPIO_MUX2_IO06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_39_GPIO_MUX2_IO07,   /* GPIO_EMC_B1_39 is configured as GPIO_MUX2_IO07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_17_GPIO_MUX2_IO27,   /* GPIO_EMC_B2_17 is configured as GPIO_MUX2_IO27 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_GPR->GPR40 = ((IOMUXC_GPR->GPR40 &
    (~(IOMUXC_GPR_GPR40_GPIO_MUX2_GPIO_SEL_LOW_MASK))) /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR40_GPIO_MUX2_GPIO_SEL_LOW(0x00U) /* GPIO2 and CM7_GPIO2 share same IO MUX function, GPIO_MUX2 selects one GPIO function: 0x00U */
    );
  IOMUXC_GPR->GPR41 = ((IOMUXC_GPR->GPR41 &
    (~(IOMUXC_GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH_MASK))) /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH(0x00U) /* GPIO2 and CM7_GPIO2 share same IO MUX function, GPIO_MUX2 selects one GPIO function: 0x00U */
    );
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_04_DIG_GPIO13_IO07,    /* GPIO_SNVS_04_DIG is configured as GPIO13_IO07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_05_DIG_GPIO13_IO08,    /* GPIO_SNVS_05_DIG is configured as GPIO13_IO08 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_06_DIG_GPIO13_IO09,    /* GPIO_SNVS_06_DIG is configured as GPIO13_IO09 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_07_DIG_GPIO13_IO10,    /* GPIO_SNVS_07_DIG is configured as GPIO13_IO10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitWdogPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: A4, peripheral: WDOG1, signal: wdog_wdog_b, pin_signal: GPIO_DISP_B2_15}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitWdogPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitWdogPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_15_WDOG1_B,         /* GPIO_DISP_B2_15 is configured as WDOG1_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
